Revit 2027 API
FabricationPart.CreateHanger(Document, FabricationServiceButton, Int32, ElementId) Method
 Creates a free placed hanger.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FabricationPart CreateHanger(
	Document document,
	FabricationServiceButton button,
	int condition,
	ElementId levelId
)
Public Shared Function CreateHanger (
	document As Document,
	button As FabricationServiceButton,
	condition As Integer,
	levelId As ElementId
) As FabricationPart
public:
static FabricationPart^ CreateHanger(
	Document^ document,
	FabricationServiceButton^ button,
	int condition,
	ElementId^ levelId
)
static member CreateHanger :
        document : Document *
        button : FabricationServiceButton *
        condition : int *
        levelId : ElementId -> FabricationPart
Parameters
document Document
 The document.
button FabricationServiceButton
 The fabrication service button to use.
condition Int32
 The condition index. If the button has multiple conditions.
levelId ElementId
 The level identifier associated with the level.
Return Value
FabricationPart
 The newly-created fabrication hanger.
Exceptions
Exception | Condition
ArgumentException |  Invalid fabrication service button.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  The index condition is not larger or equal to 0 and less than ConditionCount.
See Also
Reference
FabricationPart Class
CreateHanger Overload
Autodesk.Revit.DB Namespace